Revit 2026 API

# ColorWithTransparencySetColor Method

---

set color

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetColor(
	Color color
)
```
```vb
Public Sub SetColor (
	color As Color
)
```
```cpp
public:
void SetColor(
	Color^ color
)
```
```fsharp
member SetColor :
        color : Color -> unit
```

#### Parameters

color Color
     color

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ColorWithTransparency Class

Autodesk.Revit.DB Namespace